youyun0v0/STM32-zero-to-FOC/STM32F103C8T6/3-3_Timer_Output_Compare/LED_Breathing_Light/Hardware/PWM.c
#include "stm32f10x.h"

void PWM_Init(void)
{
    //1.配置时基单元，可以找Timer.c代码，不需要打开中断，配置NVIC
        //1.使能定时器时钟
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
        //2.选择时基单元的时钟
        TIM_InternalClockConfig(TIM2); //选择内部时钟
        //3.初始化时基单元
        TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
        TIM_TimeBaseStructure.TIM_Period = 100 - 1; //自动重载值ARR，分辨率1/(ARR+1)=1%
        TIM_TimeBaseStructure.TIM_Prescaler = 720 - 1; //预分频值PSC，定时器时钟频率 = 72MHz/(PSC+1)，设置为720-1，定时器时钟频率为100kHz,PWM频率为100k/(ARR+1)=1kHz
        TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; //给数字滤波、死区生成等内部采样时钟分频，在这里没啥影响，不分频即可
        TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //计数模式，设置为向上计数（还可以选向下计数，中央对齐）
        TIM_TimeBaseStructure.TIM_RepetitionCounter = 0; //重复计数器，表示计数器重复几次之后才会产生更新事件（高级定时器才有）
        TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure); //根据上面的配置初始化TIM2
    //2.初始化输出比较单元
        TIM_OCInitTypeDef TIM_OCInitStructure;
        TIM_OCStructInit(&TIM_OCInitStructure);//结构体赋初始值
        TIM_OCInitStructure.TIM_OCMode=TIM_OCMode_PWM1;//设置输出比较模式:PWM1
        TIM_OCInitStructure.TIM_OCPolarity=TIM_OCPolarity_High;//设置输出比较极性：REF有效时，输出高电平
        TIM_OCInitStructure.TIM_OutputState=TIM_OutputState_Enable;//设置输出使能
        TIM_OCInitStructure.TIM_Pulse=0;//设置CCR,CCR=50时，占空比=CCR/(1+ARR)=50%
        //剩下的结构体成员都是高级定时器才需要用的.由于只给部分成员赋值，为了避免不确定的问题，我们需要给结构体先赋一个初值，再修改我们关心的成员
        TIM_OC1Init(TIM2,&TIM_OCInitStructure); //由于我们使用的是TIM2的OC1通道，查引脚定义表可知其复用在PA0引脚上
    //3.初始化GPIOA
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);//打开GPIOA时钟（供电）
        GPIO_InitTypeDef GPIO_InitStructure;//引脚工作参数配置
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;//选择GPIOA的A0引脚
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;//选择复用推挽输出（引脚不再由普通GPIO控制，而是给了片上的外设TIM2_CH1控制）
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//速度50MHz（电平翻转的最大频率）
        GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化GPIOA
    //4.启动定时器
        TIM_Cmd(TIM2, ENABLE); //使能TIM2
}

void PWM_SetCompare1(uint16_t Compare)
{
    TIM_SetCompare1(TIM2,Compare);//在运行过程中更改CH1的CCR值
}